# Pandas

## Pandas: Series

Series is datastructure of Pandas.it's like 1-d numpy ndarray with indices.
We can say Series is a dictionary llike object

In [2]:
#import pandas package
import pandas as pd

#### TimeSeries

Often we want to create time series, i.e creating running sequence of dates in month.

This can be achieved using date_range() function.

We can specify below mentioned parameters to get desired result.
 * Freq:how often you want to date to occur monthly,daily,hourwise.
   - freq='M' : Monthly end date.
   - freq='MS' : Monthly start/first date.
   - freq='D' : Daily
   - freq='H' : Hourwise 
 * periods: No.of sequences we want.
 * Date can be provided in any format like yyyy-mm-dd,dd-mm-yyyy,dd/mm/yyyy.

In [4]:
pd.date_range('2022-06-01',periods=12,freq="M")

DatetimeIndex(['2022-06-30', '2022-07-31', '2022-08-31', '2022-09-30',
               '2022-10-31', '2022-11-30', '2022-12-31', '2023-01-31',
               '2023-02-28', '2023-03-31', '2023-04-30', '2023-05-31'],
              dtype='datetime64[ns]', freq='M')

In [6]:
day=pd.date_range('2022/06/01',periods=12,freq="M")

#### To Create date range to index:Use index property of Series.

In [10]:
import numpy as np
series=pd.Series(np.arange(10,22))
print(series)
series.index=day
print("\nMaking day range index\n",series)

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
dtype: int32

Making day range index
 2022-06-30    10
2022-07-31    11
2022-08-31    12
2022-09-30    13
2022-10-31    14
2022-11-30    15
2022-12-31    16
2023-01-31    17
2023-02-28    18
2023-03-31    19
2023-04-30    20
2023-05-31    21
Freq: M, dtype: int32

### Accessing element in Series:iloc,loc

In [ ]:
import numpy as np
series=pd.Series(np.arange(0,5),index=list('abcdc')) #assigning values to index position/label
print(series[2]) #same like we access element in dictionary
print(series.iloc[3],series.values)
print("\n\nExample for loc:")
print(series.loc['c'],series.index,series.values)
print(series.iloc[3],series.index,series.values)

# Python:DataFrame

DataFrame is like 2-d Numpy Array with indices and column

In [28]:
df=pd.read_csv("CollegePlacement.csv")
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2966 entries, 0 to 2965
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                2966 non-null   int64
 1   Gender             2966 non-null   object
 2   Stream             2966 non-null   object
 3   Internships        2966 non-null   int64
 4   CGPA               2966 non-null   int64
 5   Hostel             2966 non-null   int64
 6   HistoryOfBacklogs  2966 non-null   int64
 7   PlacedOrNot        2966 non-null   int64
dtypes: int64(6), object(2)
memory usage: 185.5+ KB
None

In [30]:
df.describe()

,Age,Internships,CGPA,Hostel,HistoryOfBacklogs,PlacedOrNot
count,2966.000000,2966.000000,2966.000000,2966.000000,2966.000000,2966.000000
mean,21.485840,0.703641,7.073837,0.269049,0.192178,0.552596
std,1.324933,0.740197,0.967748,0.443540,0.394079,0.497310
min,19.000000,0.000000,5.000000,0.000000,0.000000,0.000000
25%,21.000000,0.000000,6.000000,0.000000,0.000000,0.000000
50%,21.000000,1.000000,7.000000,0.000000,0.000000,1.000000
75%,22.000000,1.000000,8.000000,1.000000,0.000000,1.000000
max,30.000000,3.000000,9.000000,1.000000,1.000000,1.000000

In [33]:
df.mean()

C:\Users\sahuy\AppData\Local\Temp/ipykernel_10248/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age                  21.485840
Internships           0.703641
CGPA                  7.073837
Hostel                0.269049
HistoryOfBacklogs     0.192178
PlacedOrNot           0.552596
dtype: float64

In [35]:
df.mean(1)  #1 here depicts that mean is calcukated row wise;0 depicts column wise

C:\Users\sahuy\AppData\Local\Temp/ipykernel_10248/2498773019.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(1)  #1 here depicts that mean is calcukated row wise;0 depicts column wise

0       5.666667
1       5.166667
2       5.000000
3       5.166667
4       5.333333
          ...
2961    5.000000
2962    5.333333
2963    5.000000
2964    5.000000
2965    5.333333
Length: 2966, dtype: float64

In [40]:
df=pd.DataFrame({"Student":['Anil','Bashit','Suresh','Champak'],"Grades":["A","B","C","D"]})
df

   Student Grades
0     Anil      A
1   Bashit      B
2   Suresh      C
3  Champak      D

In [44]:
df.index=list(range(1,5))
df

   Student Grades
1     Anil      A
2   Bashit      B
3   Suresh      C
4  Champak      D

In [47]:
ary=df.values   #2d-array
ary

array([['Anil', 'A'],
       ['Bashit', 'B'],
       ['Suresh', 'C'],
       ['Champak', 'D']], dtype=object)

In [48]:
df=pd.DataFrame(ary,columns=["Names","Grades"])
df

     Names Grades
0     Anil      A
1   Bashit      B
2   Suresh      C
3  Champak      D